Revit 2024 API
MacroManager.SetDocumentMacroSecurityOptions Method
 Sets the document macro security options.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static void SetDocumentMacroSecurityOptions(
	Application application,
	DocumentMacroOptions macroOptions
)
Visual Basic
Public Shared Sub SetDocumentMacroSecurityOptions ( _
	application As Application, _
	macroOptions As DocumentMacroOptions _
)
Visual C++
public:
static void SetDocumentMacroSecurityOptions(
	Application^ application,
	DocumentMacroOptions macroOptions
)
Parameters
application
Type: Autodesk.Revit.ApplicationServices.Application
 The application.
macroOptions
Type: Autodesk.Revit.DB.Macros.DocumentMacroOptions
 The document macro security options.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
MacroManager Class
Autodesk.Revit.DB.Macros Namespace